#include <iostream>
#include <string>

using namespace std;

int main()
{
	setlocale(0, "");
	int day, month;
	cout << "Введите номер дня в месяце (от 1 до 31)" << endl;
	cout << "Введите номер месяца в году (от 1 до 12)" << endl;
	cin >> day >> month;
	day = day - 1;
	month = month - 1;
	string day[31] = { "Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое",
	"Одиннацатое", "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое", "Девятнадцатое", "Двадцатое",
	"Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать четвертое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое",
	"Тридцатое", "Тридцать первое" };
	string month[12] = { "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь" };


	system("pause");
	return 0;
}

