#include <iostream>
#include <string>

using namespace std;

int main()
{
	setlocale(0, "");
	int a;
	string b[31] = { "Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадцать", "Шестнадцать", "Семнадцать", "Восемнадцать",
		"Девятнадцать", "Двадцать", "Двадцать одно", "Двадцать два", "Двадцать три", "Двадцать четыре", "Двадцать пять", "Двадцать шесть", "Двадцать семь",
		"Двадцать восемь", "Двадцать девять", "Тридцать", "Тридцать одно", "Тридцать два", "Тридцать три", "Тридцать четыре", "Тридцать пять", "Тридцать шесть",
		"Тридцать семь", "Тридцать восемь", "Тридацать девять", "Сорок" };
	string c[2] = { " учебных заданий", " учебное задание" };
	cout << "Введите целое число A учебных заданий." << endl;
	cin >> a;

	

	if (a >= 10 && a <= 40)
	{ 
		a = a - 10;
		if (a == 21 || a == 31)
		{
			cout << b[a] << c[1] << endl;
		}
		else
		{
			cout << b[a] << c[0] << endl;
		}
	}
	else
	{
		cout <<"Вы ввели число не из диапозона (10-40). Попробуйте еще раз." << endl;
	}

	system("pause");
	return 0;
}
